# Data Analysis with Pandas
[<a href="#Bottom">Top to Bottom</a>]

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-Analysis-with-Pandas" data-toc-modified-id="Data-Analysis-with-Pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data Analysis with Pandas</a></span><ul class="toc-item"><li><span><a href="#What-is-Pandas?" data-toc-modified-id="What-is-Pandas?-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>What is Pandas?</a></span></li><li><span><a href="#Pandas-Series" data-toc-modified-id="Pandas-Series-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pandas Series</a></span></li><li><span><a href="#Pandas-DataFrame" data-toc-modified-id="Pandas-DataFrame-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Pandas DataFrame</a></span></li><li><span><a href="#Advantages-of-Pandas" data-toc-modified-id="Advantages-of-Pandas-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Advantages of Pandas</a></span></li><li><span><a href="#Creating-Series" data-toc-modified-id="Creating-Series-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Creating Series</a></span></li><li><span><a href="#Exploring-Datasets" data-toc-modified-id="Exploring-Datasets-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Exploring Datasets</a></span></li><li><span><a href="#How-to-read-a-tabular-data-file-into-pandas?" data-toc-modified-id="How-to-read-a-tabular-data-file-into-pandas?-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>How to read a tabular data file into pandas?</a></span></li><li><span><a href="#How-to-select-a-pandas-series-from-a-DataFrame?" data-toc-modified-id="How-to-select-a-pandas-series-from-a-DataFrame?-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>How to select a pandas series from a DataFrame?</a></span></li></ul></li></ul></div>

## What is Pandas?
The Pandas library is built on NumPy and provides easy-to-use data structures and data analysis tools for the Python programming language.
## Pandas Series 
A **one-dimensional** labeled array a capable of holding any data type

## Pandas DataFrame 
A **two-dimensional** labeled data structure with columns of potentially different types
![Pandas](../img/pandas.png)

## Advantages of Pandas 
- Data representation
- Less writing and more work done
- An extensive set of features
- Efficiently handles large data
- Makes data flexible and customizable
- Made for Python

In [1]:
# Conventional  way to import pandas 
import pandas as pd

In [2]:
# Check pandas version
pd.__version__

'0.25.1'

In [3]:
# Show version of all packages 
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.4.final.0
python-bits      : 64
OS               : Linux
OS-release       : 5.3.0-26-generic
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 0.25.1
numpy            : 1.17.2
pytz             : 2019.3
dateutil         : 2.8.0
pip              : 19.2.3
setuptools       : 41.4.0
Cython           : 0.29.13
pytest           : 5.2.1
hypothesis       : None
sphinx           : 2.2.0
blosc            : None
feather          : None
xlsxwriter       : 1.2.1
lxml.etree       : 4.4.1
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.10.3
IPython          : 7.8.0
pandas_datareader: None
bs4              : 4.8.0
bottleneck       : 1.2.1
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.4.1
matplotlib       : 3.1.1
numexpr          : 2.7.0
odfpy            : None
openpyxl         : 3.0.0
pandas_gbq       : None
pyarrow          : None
pytables         : None
s3fs             : None
scipy            : 1.3.1
sqlalchemy       : 1.3.9
tables           : 3.5.2
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
xlsxwriter       : 1.2.1

## Creating Series

In [4]:
# Create Series 
s1 = pd.Series([3, 6, 9, 12])
s1

0     3
1     6
2     9
3    12
dtype: int64

In [5]:
# Check type 
type(s1)

pandas.core.series.Series

In [6]:
# To see values 
s1.values

array([ 3,  6,  9, 12])

In [7]:
# To see index/keys 
s1.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
# Creating labeled series 
s2 = pd.Series([200000, 300000, 4000000, 500000], index=['A', 'B', 'C', 'D'])
s2

A     200000
B     300000
C    4000000
D     500000
dtype: int64

In [10]:
s2.values

array([ 200000,  300000, 4000000,  500000])

In [11]:
s2.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# Indexing
s2['A']

200000

In [13]:
# Boolean indexing
s2['A'] > 700000

False

[<a href="#Data-Analysis-with-Pandas">Back to Top</a>]

## Exploring Datasets

Filename | Description | Raw File | Original Source | Other
--- | --- | --- | --- | ---
[chipotle.tsv](data/chipotle.tsv) | Online orders from the Chipotle restaurant chain | [bit.ly/chiporders](http://bit.ly/chiporders) | [The Upshot](https://github.com/TheUpshot/chipotle) | [Upshot article](http://www.nytimes.com/interactive/2015/02/17/upshot/what-do-people-actually-order-at-chipotle.html)
[drinks.csv](data/drinks.csv) | Alcohol consumption by country | [bit.ly/drinksbycountry](http://bit.ly/drinksbycountry) | [FiveThirtyEight](https://github.com/fivethirtyeight/data/tree/master/alcohol-consumption) | [FiveThirtyEight article](http://fivethirtyeight.com/datalab/dear-mona-followup-where-do-people-drink-the-most-beer-wine-and-spirits/)
[imdb_1000.csv](data/imdb_1000.csv) | Top rated movies from IMDb | [bit.ly/imdbratings](http://bit.ly/imdbratings) | [IMDb](http://www.imdb.com/search/title?groups=top_1000&sort=user_rating&view=simple) | [Web scraping script](https://github.com/justmarkham/DAT5/blob/master/code/08_web_scraping.py)
[stocks.csv](data/stocks.csv) | Small dataset of stock prices | [bit.ly/smallstocks](http://bit.ly/smallstocks) | [DataCamp](https://www.datacamp.com/courses/manipulating-dataframes-with-pandas?tap_a=5644-dce66f&tap_s=280411-a25fc8) | 
[titanic_test.csv](data/titanic_test.csv) | Testing set from Kaggle's Titanic competition | [bit.ly/kaggletest](http://bit.ly/kaggletest) | [Kaggle](https://www.kaggle.com/c/titanic) | [Data dictionary](https://www.kaggle.com/c/titanic/data)
[titanic_train.csv](data/titanic_train.csv) | Training set from Kaggle's Titanic competition | [bit.ly/kaggletrain](http://bit.ly/kaggletrain) | [Kaggle](https://www.kaggle.com/c/titanic) | [Data dictionary](https://www.kaggle.com/c/titanic/data)
[u.user](data/u.user) | Demographic information about MovieLens users | [bit.ly/movieusers](http://bit.ly/movieusers) | [GroupLens](http://grouplens.org/datasets/movielens/100k/) | [Data dictionary](http://files.grouplens.org/datasets/movielens/ml-100k-README.txt)
[ufo.csv](data/ufo.csv) | Reports of UFO sightings from 1930-2000 | [bit.ly/uforeports](http://bit.ly/uforeports) | [National UFO Reporting Center](http://www.nuforc.org/webreports.html) | [Web scraping script](https://github.com/josiahdavis/josiahdavis.github.io/blob/master/supporting%20material/get_ufo_data.py)

## How to read a tabular data file into pandas?

In [1]:
# conventional way to import pandas
import pandas as pd

In [2]:
# read a dataset of Chipotle orders directly from a URL and store the results in a DataFrame 
orders = pd.read_table('http://bit.ly/chiporders')

In [3]:
# examine the first 5 rows 
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
# examine the last 5 rows 
orders.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [5]:
# examine the first `n` number of rows
orders.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [6]:
# examine the last `n` number of rows
orders.tail(10)

,order_id,quantity,item_name,choice_description,item_price
4612,1831,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$9.25
4613,1831,1,Chips,NaN,$2.15
4614,1831,1,Bottled Water,NaN,$1.50
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [7]:
# read a dataset of movie reviewers (modifying the default parameter values for read_table)
users = pd.read_table('http://bit.ly//movieusers')

In [8]:
# examine the first 5 rows 
users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [9]:
# DataFrame looks ugly. let's modify the default parameter for read_table 
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly//movieusers', sep='|' , header=None, names=user_cols)

In [10]:
# now take a look at modified dataset
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
# read text/csv data into pandas 
chrom = pd.read_csv("./data/Encode_HMM_data.txt", delimiter="\t", header=None)

In [12]:
chrom.head()

      0      1      2                  3  4  5      6      7            8
0  chr1  10000  10600  15_Repetitive/CNV  0  .  10000  10600  245,245,245
1  chr1  10600  11137  13_Heterochrom/lo  0  .  10600  11137  245,245,245
2  chr1  11137  11737        8_Insulator  0  .  11137  11737   10,190,254
3  chr1  11737  11937        11_Weak_Txn  0  .  11737  11937  153,255,102
4  chr1  11937  12137    7_Weak_Enhancer  0  .  11937  12137    255,252,4

In [13]:
# it's not much better to see. so we have to modify this dataset
cols_name = ['chrom', 'start', 'stop', 'type']
chrom = pd.read_csv("./data/Encode_HMM_data.txt", delimiter="\t", header=None, names=cols_name)

In [14]:
# now 
chrom.head()

                                     chrom  start   stop         type
chr1 10000 10600 15_Repetitive/CNV 0     .  10000  10600  245,245,245
     10600 11137 13_Heterochrom/lo 0     .  10600  11137  245,245,245
     11137 11737 8_Insulator       0     .  11137  11737   10,190,254
     11737 11937 11_Weak_Txn       0     .  11737  11937  153,255,102
     11937 12137 7_Weak_Enhancer   0     .  11937  12137    255,252,4

[Documentation for `read_table`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_table.html)

[<a href="#Data-Analysis-with-Pandas">Back to Top</a>]

## How to select a pandas series from a DataFrame?

In [14]:
# conventional way to import pandas
import pandas as pd

In [15]:
# read a dataset of UFO reports into DataFrame 
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')

# read a csv is equivalent to read_table, except it assumes a comma separator 
ufo = pd.read_csv('http://bit.ly/uforeports')

In [16]:
# examine first 5 rows 
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [17]:
# select 'City' Series using bracket notation
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [18]:
# select 'City' Series using dot(.) notation
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

**Note:
- Bracket notation will always work, whereas dot notation has **limitations**
- Dot notation doesn't work if there are **spaces** in the Series name
- Dot notation doesn't work if the Series has the same name as a **DataFrame method or attribute** (like 'head' or 'shape')
- Dot notation can't be used to define the name of a **new Series** (see below)

In [19]:
# create a new 'Location' Series (must use bracket notation to define the Series name)
ufo['Location'] = ufo.City + ', ' + ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

[<a href="#Data-Analysis-with-Pandas">Back to Top</a>]